# PinnedObjectNotDeleted Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..PinnedObjectNotDeleted Property
BuiltInFailures..::..EditingFailures Class See Also
---
Pinned objects were not deleted. To delete them, unpin them before using delete.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PinnedObjectNotDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PinnedObjectNotDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PinnedObjectNotDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace